# Python Data Analysis Library

In [1]:
import pandas as pd

## Series

In [2]:
[] # [] 는 list 생성

[]

In [3]:
# \파이썬의 리스트
odd = [1, 3, 5, 7, 9] # = 할당, == 비교연산자
odd

[1, 3, 5, 7, 9]

In [4]:
odd[1]

3

In [5]:
pd.Series(odd)

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [6]:
pd_odd = pd.Series(odd)
pd_odd

#dtype: int, data 타입이 int 다

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [7]:
odd.mean # 시리즈 테이터 타입이 아니라서 평균 구할 수 없음.

AttributeError: 'list' object has no attribute 'mean'

In [ ]:
# 판다스에 있는 시리즈 데이터 타입으로 변경해주고
# 기초 통계 값을 출력해 봅니다.

pd_odd.mean()

## DataFrame

In [8]:
numbers

NameError: name 'numbers' is not defined

In [16]:
numbers = [
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]
]
numbers

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [17]:
pd_numbers = pd.DataFrame(numbers)
pd_numbers

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [18]:
type(numbers)

list

In [19]:
type(pd_numbers)

pandas.core.frame.DataFrame

In [20]:
type(pd_numbers[0])

pandas.core.series.Series

In [21]:
# 컬럼으로 값을 가져옵니다.

pd_numbers[0]

0    1
1    4
2    7
Name: 0, dtype: int64

In [22]:
# loc == locate, 행, 열 값을 통해 값을 가져옵니다.
# loc[행,열]
# loc[행]

pd_numbers.loc[0]

0    1
1    2
2    3
Name: 0, dtype: int64

In [23]:
pd_numbers.loc[0,2]

3

## DataFrame 생성하기

In [24]:
# Name 컬럼을 Index 로 만듬

transaction_url = "https://bit.ly/dsa-transaction"
transaction = pd.read_csv(transaction_url, index_col = "Name")
transaction

            date  price      state
Name
Kang  2017-01-01    500  confirmed
Kim   2017-01-03    700  confirmed
Choi  2017-01-03    900  confirmed
Park  2017-01-05    800  confirmed
Lee   2017-01-07    500   canceled
Yoon  2017-01-09    700  confirmed
Jang  2017-01-09    600   canceled
Ko    2017-01-10    200   canceled

In [25]:
# transaction 이라는 변수에 담긴 데이터프레임의 index 값을 가져옵니다.

transaction.index

Index(['Kang', 'Kim', 'Choi', 'Park', 'Lee', 'Yoon', 'Jang', 'Ko'], dtype='object', name='Name')

In [26]:
# transaction 이라는 변수에 담긴 데이터프레임의 columns 값을 가져옵니다.

transaction.columns

Index(['date', 'price', 'state'], dtype='object')

In [27]:
# transaction 이라는 변수에 담긴 데이터프레임의 값만 가져옵니다.
# 이전에 실습했던 numbers에 담긴 리스트 값과 비교해 보시면 좋습니다.
# dtype=object, str을 의미한다.

transaction.values

array([['2017-01-01', 500, 'confirmed'],
       ['2017-01-03', 700, 'confirmed'],
       ['2017-01-03', 900, 'confirmed'],
       ['2017-01-05', 800, 'confirmed'],
       ['2017-01-07', 500, 'canceled'],
       ['2017-01-09', 700, 'confirmed'],
       ['2017-01-09', 600, 'canceled'],
       ['2017-01-10', 200, 'canceled']], dtype=object)

In [28]:
numbers

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [29]:
# transaction.head? 파이썬의 자기호출 기능을 사용해서 문서를 보실 수 있습니다.
# shift + tab 키를 매소드의 소괄호 안에서 누르면
# 위에서 보신 동일한 문서를 툴팁으로 보실 수 있습니다.

transaction.head()

            date  price      state
Name
Kang  2017-01-01    500  confirmed
Kim   2017-01-03    700  confirmed
Choi  2017-01-03    900  confirmed
Park  2017-01-05    800  confirmed
Lee   2017-01-07    500   canceled

In [30]:
transaction.tail()

            date  price      state
Name
Park  2017-01-05    800  confirmed
Lee   2017-01-07    500   canceled
Yoon  2017-01-09    700  confirmed
Jang  2017-01-09    600   canceled
Ko    2017-01-10    200   canceled

In [31]:
# 데이터 프레임 뿐만 아니라 시리즈 테이터도 미리보기가 가능하다.

transaction["date"].head()

Name
Kang    2017-01-01
Kim     2017-01-03
Choi    2017-01-03
Park    2017-01-05
Lee     2017-01-07
Name: date, dtype: object

In [37]:
transaction.columns

Index(['date', 'amount', 'result'], dtype='object')

In [38]:
# 컬럼명을 변경해 줍니다.

transaction.columns = ["date", "amount", "result"]
transaction

            date  amount     result
Name
Kang  2017-01-01     500  confirmed
Kim   2017-01-03     700  confirmed
Choi  2017-01-03     900  confirmed
Park  2017-01-05     800  confirmed
Lee   2017-01-07     500   canceled
Yoon  2017-01-09     700  confirmed
Jang  2017-01-09     600   canceled
Ko    2017-01-10     200   canceled

## 기본연산

In [41]:
# 평균값을 구해옵니다.

transaction["amount"].mean()

612.5

In [43]:
# 최소값

transaction["amount"].min()

200

In [44]:
# 최대값

transaction["amount"].max()

900

In [51]:
# 중간값

transaction["amount"].median()

650.0

In [53]:
transaction["amount"].describe()

# std 표준편차
# 50%를 중간값으로 봐도 됨
# 최대값, 최소값의 편향이 너무 심하면 중간값 사용

count      8.000000
mean     612.500000
std      216.712449
min      200.000000
25%      500.000000
50%      650.000000
75%      725.000000
max      900.000000
Name: amount, dtype: float64

In [46]:
# 깂이 몇개의 종류별로 나옴

transaction["result"].unique()

array(['confirmed', 'canceled'], dtype=object)

In [47]:
# 카테고리를 그룹화 해서 갯수를 세어줍니다.

transaction["result"].value_counts()

confirmed    5
canceled     3
Name: result, dtype: int64

In [48]:
# 데이터에서 어느정도 비율을 차지하고 있는지 구해볼 수 있습니다.

transaction["result"].value_counts(normalize = True)

confirmed    0.625
canceled     0.375
Name: result, dtype: float64

In [54]:
# 전체 데이터에서 어떤 데이터가 최대값을 의미하는지 보고자 할 때

transaction["amount"] == transaction["amount"].max()

Name
Kang    False
Kim     False
Choi     True
Park    False
Lee     False
Yoon    False
Jang    False
Ko      False
Name: amount, dtype: bool

In [55]:
# 전체 데이터에서 어떤 데이터가 최대값을 의미하는지 보고자 할 때

transaction[transaction["amount"] == transaction["amount"].max()]

            date  amount     result
Name
Choi  2017-01-03     900  confirmed

In [56]:
transaction

            date  amount     result
Name
Kang  2017-01-01     500  confirmed
Kim   2017-01-03     700  confirmed
Choi  2017-01-03     900  confirmed
Park  2017-01-05     800  confirmed
Lee   2017-01-07     500   canceled
Yoon  2017-01-09     700  confirmed
Jang  2017-01-09     600   canceled
Ko    2017-01-10     200   canceled

In [64]:
# confirmed => confirm
# canceled => cancel
# 코드 내에서 개행을 하고자 할 때는 역슬래시를 사용합니다.

transaction["result"] = transaction["result"]\
                    .replace("confirmed" , "confirm") \
                    .replace("canceled", "cancel")

transaction["result"]

Name
Kang    confirm
Kim     confirm
Choi    confirm
Park    confirm
Lee      cancel
Yoon    confirm
Jang     cancel
Ko       cancel
Name: result, dtype: object

In [65]:
transaction["result"]

Name
Kang    confirm
Kim     confirm
Choi    confirm
Park    confirm
Lee      cancel
Yoon    confirm
Jang     cancel
Ko       cancel
Name: result, dtype: object

## 날짜와 시간

In [66]:
# object == string
# datetime의 다양한 기능을 사용하기 위해
# 데이터의 형식을 datetime 으로 바꿔줄 필요가 있습니다.

transaction["date"]

Name
Kang    2017-01-01
Kim     2017-01-03
Choi    2017-01-03
Park    2017-01-05
Lee     2017-01-07
Yoon    2017-01-09
Jang    2017-01-09
Ko      2017-01-10
Name: date, dtype: object

In [69]:
# 데이터의 형식 변경후에는 꼭 사용하고자 하는 컬럼에 
# 생성 & 변경으로 할당을 해주셔야 합니다.

transaction["date"] = pd.to_datetime(transaction["date"])

In [73]:
transaction["date"]

Name
Kang   2017-01-01
Kim    2017-01-03
Choi   2017-01-03
Park   2017-01-05
Lee    2017-01-07
Yoon   2017-01-09
Jang   2017-01-09
Ko     2017-01-10
Name: date, dtype: datetime64[ns]

In [74]:
transaction["date"].dt.year

Name
Kang    2017
Kim     2017
Choi    2017
Park    2017
Lee     2017
Yoon    2017
Jang    2017
Ko      2017
Name: date, dtype: int64

In [75]:
# 요일 표시

transaction["date"].dt.dayofweek

Name
Kang    6
Kim     1
Choi    1
Park    3
Lee     5
Yoon    0
Jang    0
Ko      1
Name: date, dtype: int64

## 행렬 접근하기

In [77]:
# series 의 형태

transaction["date"]

Name
Kang   2017-01-01
Kim    2017-01-03
Choi   2017-01-03
Park   2017-01-05
Lee    2017-01-07
Yoon   2017-01-09
Jang   2017-01-09
Ko     2017-01-10
Name: date, dtype: datetime64[ns]

In [83]:
# DateFrame 의 형태

transaction[["date"]]

           date
Name
Kang 2017-01-01
Kim  2017-01-03
Choi 2017-01-03
Park 2017-01-05
Lee  2017-01-07
Yoon 2017-01-09
Jang 2017-01-09
Ko   2017-01-10

In [84]:
# 파이썬에서 여러 개의 데이터를 다룰 때는 리스트를 사용합니다.
# 하나의 컬럼을 가져올 때는 컬럼 이름을 지정해 주면 되지만
# 여러개의 컬럼을 가져올 때는 리스트로 지정해 줍니다.

transaction[["date", "amount"]]

           date  amount
Name
Kang 2017-01-01     500
Kim  2017-01-03     700
Choi 2017-01-03     900
Park 2017-01-05     800
Lee  2017-01-07     500
Yoon 2017-01-09     700
Jang 2017-01-09     600
Ko   2017-01-10     200

In [85]:
# 리스트에 사용할 컬럼며을 지정해 줍니다.

columns = ["date", "amount"]
transaction[columns]

           date  amount
Name
Kang 2017-01-01     500
Kim  2017-01-03     700
Choi 2017-01-03     900
Park 2017-01-05     800
Lee  2017-01-07     500
Yoon 2017-01-09     700
Jang 2017-01-09     600
Ko   2017-01-10     200

In [87]:
# 하나의 컬럼만 가져오면 Series == Vector == list

type(transaction["date"])

pandas.core.series.Series

In [89]:
# 여러 개의 컬럼을 가져오면 DataFrame == Matrix (행렬) == 다차원배열

type(transaction[["date"]])

pandas.core.frame.DataFrame

In [88]:
type(transaction[columns])

pandas.core.frame.DataFrame

In [90]:
# loc == locate
# loc[행]
# loc[행, 열]
transaction.loc["Kang"]

date      2017-01-01 00:00:00
amount                    500
result                confirm
Name: Kang, dtype: object

In [92]:
transaction.loc[["Kang", "Kim", "Choi"]]

           date  amount   result
Name
Kang 2017-01-01     500  confirm
Kim  2017-01-03     700  confirm
Choi 2017-01-03     900  confirm

In [93]:
# 대소문자에 유의해서 가져옵니다.

transaction.loc[["Kang", "kim", "Choi"]]

C:\Users\jjcor\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

           date  amount   result
Name
Kang 2017-01-01   500.0  confirm
kim         NaT     NaN      NaN
Choi 2017-01-03   900.0  confirm

In [94]:
names = ["Kang", "Kim", "Choi"]
names

['Kang', 'Kim', 'Choi']

In [96]:
transaction.loc[names]

           date  amount   result
Name
Kang 2017-01-01     500  confirm
Kim  2017-01-03     700  confirm
Choi 2017-01-03     900  confirm

## 성능
 * timeit 으로 프로파일링 해봅니다.

In [99]:
# bad practice

transaction.loc["Kang"]["date"]

Timestamp('2017-01-01 00:00:00')

In [100]:
# good practice

transaction.loc["Kang", "date"]

Timestamp('2017-01-01 00:00:00')

In [101]:
%timeit transaction.loc["Kang"]["date"]

140 µs ± 857 ns per loop (mean ± std. dev. of 7 runs, 10000 loops each)

In [102]:
%timeit transaction.loc["Kang", "date"]

6.92 µs ± 35.6 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

## 색인

In [104]:
# 조건을 작성하면 True, False 불리언 값으로 데이터를 가져오고
# 데이터프레임으로 그 결과를 감싸주면 해당되는 데이터만 색인해 옵니다.

transaction[transaction["date"] == "2017-01-03"]

           date  amount   result
Name
Kim  2017-01-03     700  confirm
Choi 2017-01-03     900  confirm

In [105]:
transaction["amount"] >= 500

Name
Kang     True
Kim      True
Choi     True
Park     True
Lee      True
Yoon     True
Jang     True
Ko      False
Name: amount, dtype: bool

In [106]:
# 조건에 True 로 표시되는 값만 색인해 옵니다.

transaction[transaction["amount"] >= 500]

           date  amount   result
Name
Kang 2017-01-01     500  confirm
Kim  2017-01-03     700  confirm
Choi 2017-01-03     900  confirm
Park 2017-01-05     800  confirm
Lee  2017-01-07     500   cancel
Yoon 2017-01-09     700  confirm
Jang 2017-01-09     600   cancel

In [112]:
# == 값은 값을 가져옵니다.
# != 다른 값을 가져옵니다.

transaction[transaction["date"] == "2017-01-09"]

           date  amount   result
Name
Yoon 2017-01-09     700  confirm
Jang 2017-01-09     600   cancel

In [113]:
transaction[transaction["date"] != "2017-01-09"]

           date  amount   result
Name
Kang 2017-01-01     500  confirm
Kim  2017-01-03     700  confirm
Choi 2017-01-03     900  confirm
Park 2017-01-05     800  confirm
Lee  2017-01-07     500   cancel
Ko   2017-01-10     200   cancel

In [120]:
# isin 구문은 열이 list의 값들을 포함하고 있는 모든 행들을 골라낼 때 주로 쓰인다. 

date_candidate = ["2017-01-01", "2017-01-05", "2017-01-10"]
transaction["date"].isin(date_candidate)

Name
Kang     True
Kim     False
Choi    False
Park     True
Lee     False
Yoon    False
Jang    False
Ko       True
Name: date, dtype: bool

In [123]:
# ~ 표시를 해주면 not의 의미를 갖습니다.
# 해당되지 않는 데이터만 가져옵니다.

~transaction["date"].isin(date_candidate)

Name
Kang    False
Kim      True
Choi     True
Park    False
Lee      True
Yoon     True
Jang     True
Ko      False
Name: date, dtype: bool

In [121]:
transaction[transaction["date"].isin(date_candidate)]

           date  amount   result
Name
Kang 2017-01-01     500  confirm
Park 2017-01-05     800  confirm
Ko   2017-01-10     200   cancel

In [122]:
# ~ 표시를 해주면 not의 의미를 갖습니다.
# 해당되지 않는 데이터만 가져옵니다.

transaction[~transaction["date"].isin(date_candidate)]

           date  amount   result
Name
Kim  2017-01-03     700  confirm
Choi 2017-01-03     900  confirm
Lee  2017-01-07     500   cancel
Yoon 2017-01-09     700  confirm
Jang 2017-01-09     600   cancel

In [130]:
# 연산자의 우선순위 때문에 오류가 나기 때문에 조건을 소괄호로 묶어줍니다.

transaction[(transaction["amount"] >= 500) 
            & (transaction["result"] == "confirm")]

           date  amount   result
Name
Kang 2017-01-01     500  confirm
Kim  2017-01-03     700  confirm
Choi 2017-01-03     900  confirm
Park 2017-01-05     800  confirm
Yoon 2017-01-09     700  confirm

In [131]:
# 위의 코드와 동일하지만 변수에 담아서 사용하시면
# 조건이 많아 질때 코드를 간결하고 가독성있게 작성하실 수 있습니다.

high = transaction["amount"] >= 500
confirm = transaction["result"] == "confirm"

high & confirm

Name
Kang     True
Kim      True
Choi     True
Park     True
Lee     False
Yoon     True
Jang    False
Ko      False
dtype: bool

In [132]:
# 둘다 True 인 값만 가져옵니다.

transaction[high & confirm]

           date  amount   result
Name
Kang 2017-01-01     500  confirm
Kim  2017-01-03     700  confirm
Choi 2017-01-03     900  confirm
Park 2017-01-05     800  confirm
Yoon 2017-01-09     700  confirm

In [134]:
# 둘 중 하나 이상 True 일때 값을 가져옵니다.

transaction[high | confirm]

           date  amount   result
Name
Kang 2017-01-01     500  confirm
Kim  2017-01-03     700  confirm
Choi 2017-01-03     900  confirm
Park 2017-01-05     800  confirm
Lee  2017-01-07     500   cancel
Yoon 2017-01-09     700  confirm
Jang 2017-01-09     600   cancel

In [140]:
# loc[행]
# loc[행, 열]

transaction.loc[transaction["result"] == "confirm", "amount"]

Name
Kang    500
Kim     700
Choi    900
Park    800
Yoon    700
Name: amount, dtype: int64

## 컬럼 추가 & 수정하기

In [142]:
# 없는 컬럼명을 지정하고 값을 할당해 주면 새로운 컬럼이 생깁니다.

transaction["card-holder"] = "KB Card"
transaction

           date  amount   result card-holder
Name
Kang 2017-01-01     500  confirm     KB Card
Kim  2017-01-03     700  confirm     KB Card
Choi 2017-01-03     900  confirm     KB Card
Park 2017-01-05     800  confirm     KB Card
Lee  2017-01-07     500   cancel     KB Card
Yoon 2017-01-09     700  confirm     KB Card
Jang 2017-01-09     600   cancel     KB Card
Ko   2017-01-10     200   cancel     KB Card

In [143]:
# 리스트로 값을 넣어줄 때는 행의 갯수가 동일하게 맞아야 합니다.

transaction["order"] = [1, 2, 3, 4, 5, 6, 7, 8]
transaction

           date  amount   result card-holder  order
Name
Kang 2017-01-01     500  confirm     KB Card      1
Kim  2017-01-03     700  confirm     KB Card      2
Choi 2017-01-03     900  confirm     KB Card      3
Park 2017-01-05     800  confirm     KB Card      4
Lee  2017-01-07     500   cancel     KB Card      5
Yoon 2017-01-09     700  confirm     KB Card      6
Jang 2017-01-09     600   cancel     KB Card      7
Ko   2017-01-10     200   cancel     KB Card      8

In [147]:
# 조건으로 색인해서 bool(True, False)로 나온 값을 그대로 담아줄 수 있습니다.

transaction["VIP"] = transaction["amount"] >= 500
transaction

           date  amount   result card-holder  order    VIP
Name
Kang 2017-01-01     500  confirm     KB Card      1   True
Kim  2017-01-03     700  confirm     KB Card      2   True
Choi 2017-01-03     900  confirm     KB Card      3   True
Park 2017-01-05     800  confirm     KB Card      4   True
Lee  2017-01-07     500   cancel     KB Card      5   True
Yoon 2017-01-09     700  confirm     KB Card      6   True
Jang 2017-01-09     600   cancel     KB Card      7   True
Ko   2017-01-10     200   cancel     KB Card      8  False

In [150]:
# loc[행, 열]

transaction.loc[transaction["amount"] >= 500, "state"] = "VIP"
transaction.loc[transaction["amount"] < 500, "state"] = "non-VIP"
transaction

           date  amount   result card-holder  order    VIP    state
Name
Kang 2017-01-01     500  confirm     KB Card      1   True      VIP
Kim  2017-01-03     700  confirm     KB Card      2   True      VIP
Choi 2017-01-03     900  confirm     KB Card      3   True      VIP
Park 2017-01-05     800  confirm     KB Card      4   True      VIP
Lee  2017-01-07     500   cancel     KB Card      5   True      VIP
Yoon 2017-01-09     700  confirm     KB Card      6   True      VIP
Jang 2017-01-09     600   cancel     KB Card      7   True      VIP
Ko   2017-01-10     200   cancel     KB Card      8  False  non-VIP

## apply
  * 함수와 함께 사용합니다.

In [163]:
# def == define
# def로 함수를 정의합니다.

def is_vip(amounts):
    """
    amounts 값에 따라 VIP 여부를 반환하는 함수입니다.
    파라메터로 받는 amounts라는 변수는 컬럼명과 달라도 상관 없습니다.
    """
    if amounts >= 500:
        return "VIP"
    else:
        return "non-VIP"

In [164]:
# 만들어진 함수가 제대로 동작하는지만 확인합니다.
# 테스트용 코드입니다.

is_vip(500)

'VIP'

In [167]:
# 위에서 loc로 조건을 만들어서 값을 지정해 주었던 코드와 같은 결과가 됩니다.

transaction["state"] = transaction["amount"].apply(is_vip)
transaction

           date  amount   result card-holder  order    VIP    state     sate
Name
Kang 2017-01-01     500  confirm     KB Card      1   True      VIP      VIP
Kim  2017-01-03     700  confirm     KB Card      2   True      VIP      VIP
Choi 2017-01-03     900  confirm     KB Card      3   True      VIP      VIP
Park 2017-01-05     800  confirm     KB Card      4   True      VIP      VIP
Lee  2017-01-07     500   cancel     KB Card      5   True      VIP      VIP
Yoon 2017-01-09     700  confirm     KB Card      6   True      VIP      VIP
Jang 2017-01-09     600   cancel     KB Card      7   True      VIP      VIP
Ko   2017-01-10     200   cancel     KB Card      8  False  non-VIP  non-VIP